app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      if Artist.exists?(id: params[:artist_id])
        @songs = Artist.find(params[:artist_id]).songs
      else
        flash[:alert] = "Song not found"
        redirect_to(artists_path)
      end
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
---
  def show
    if Song.exists?(id: params[:id])
      @song = Song.find(params[:id])
    elsif Artist.exists?(id: params[:artist_id])
      artist = Artist.find(params[:artist_id])